{
    "PortfolioDevTitle": "Desenvolvedor Web",
    "PortfolioDevLocation": "Santa Catarina, Brasil",
    "PortfolioSumTitle": "Resumo",
    "PortfolioSumParagraphOne": "Experiente em desenvolvimento de códigos back-end em ambientes dinâmicos como o de startups de tecnologia, juntamente com experiência prática como desenvolvedor full-stack em diversos projetos universitários e pessoais.",
    "PortfolioSumParagraphTwo": "Ao longo de minha jornada profissional, passei por situações desafiadoras que me ensinaram a importância da disciplina, da colaboração, do aprendizado contínuo e da busca incessante pelo crescimento profissional. Atualmente, estou buscando novas conexões e oportunidades para trabalhar como desenvolvedor, trocar ideias e crescer profissionalmente.",
    "PortfolioExperienceTitle": "Experiência",
    "PortfolioExp": {
        "CompanyOneTitleSpecs": [
            "MOVA | Credit as a Service",
            "Desenvolvedor Backend Júnior",
            "Janeiro de 2023 - Janeiro de 2024, Remoto"
        ],
        "CompanyOneJobDesc": [
            "A Mova é a primeira plataforma de empréstimo peer-to-peer aprovada e supervisionada pelo Banco Central do Brasil na forma de uma Sociedade de Empréstimo entre Pessoas (SEP).",
            "Responsabilidades",
            "Desenvolvimento de projetos backend utilizando as tecnologias Slim e HyperF.",
            "Implementação de estratégias de cobertura de testes.",
            "Integração com o banco de dados usando MySQL e Elastic.",
            "Resultados",
            "Participação na implementação de Tags de Acesso para clientes do site.",
            "Participação nos ajustes do gerador do documento 3040 para o BACEN (Banco Central do Brasil).",
            "Estabeleci protocolos seguros de registro para identificação de operadores por meio de dados criptografados.",
            "Execução com sucesso migrações CI/CD.",
            "Execução de migrações de serviços desenvolvidos em Slim para a arquitetura HyperF."
        ],
        "CompanyTwoTitleSpecs": [
            "MOVA | Credit as a Service",
            "Estágiário",
            "Maio de 2022 - Janeiro de 2023, Remoto"
        ],
        "CompanyTwoJobDesc": [
            "Responsabilidades:",
            "Adquirir experiência prática com o framework Slim e Docker",
            "Aprender a usar o GitLab para controle eficiente de versão de código",
            "Prática dos princípios de Programação Orientada a Objetos (OOP) e SOLID em um ambiente profissional"
        ],
        "CompanyThreeTitleSpecs": [
            "Instituto Federal de Educação, Ciência e Tecnologia do Sul de Minas Gerais",
            "Programa de Mediadores Virtuais de Ensino",
            "Março de 2021 - Agosto de 2021, Poços de Caldas, Minas Gerais, Brasil"
        ],
        "CompanyThreeJobDesc": "Bolsista no programa de mediadores virtuais de ensino, cujo propósito era auxiliar a comunicação entre alunos e professores durante o ensino remoto, sob a orientação do coordenador educacional André Gripp."
    },
    "PortfolioEducationTitle": "Educação",
    "PortfolioEducationBachelorDesc": "Bacharelado em Engenharia, Engenharia de Computação · (2016 - 2022)",
    "PortfolioEducationBachelorValidation": "Endereço de Validação:",
    "PortfolioContactTitle": "Contato",
    "PortfolioSkillsDesc": [
        "Habilidades e Competências",
        "PHP - Conhecimento Avançado",
        "Javascript - Experiente",
        "Pacote Laravel + Vue.Js - Conhecimento Básico",
        "Controle de versão GIT - Experiente",
        "Banco de Dados MySQL - Experiente",
        "Desenvolvimento Orientado a Testes (TDD) - Conhecimento Avançado",
        "Fundamentos de Linguagem - Conhecimento Avançado",
        "Programação Orientada a Objetos (OOP) - Conhecimento Avançado",
        "Princípios SOLID e Melhores Práticas - Experiente",
        "Documentação de Projetos - Experiente",
        "Slim Framework - Experiente",
        "HyperF - Conhecimento Básico",
        "Elastic - Conhecimento Básico"
    ],
    "PortfolioLanguagesDesc": [
        "Línguas",
        "Português - Nativo",
        "Inglês - Avançado"
    ],
    "PortfolioCertificatesDesc": [
        "Certificados",
        "Alura - Formação Aprenda a programar em PHP",
        "Alura - Formação PHP",
        "Alura - Formação Aprofunde em PHP com arquitetura e padrões de projeto",
        "Alura - Formação Segurança de software com OWASP",
        "MOVA - Certificado de participação Hyperf",
        "DIO - Bootcamp Nexa - Fundamentos de IA Generativa e Claude 3",
        "IF - Startup Weekend Machado"
    ],
    "PortfolioButtonOne": "Visualizar PDF",
    "PortfolioButtonTwo": "Baixar PDF"
}